## Risk Prediction
### Análise exploratória dos dados de clientes de Caratão de crédito

Dados: https://archive.ics.uci.edu/ml/datasets/default+of+credit+card+clients#

### 1. Resumo  

O objetivo deste Notebook é explorar os dados, criar visualizações que facilitem o entendimento, analizar as informações do link acima e Traduzir o neome das variáveis com a finalidade de melhor entendimento.  
Ao fim .........
______________

### 2 Implementação
#### 2.1 Importação das Bibilotecas

In [17]:
import numpy as np
import pandas as pd
from pandas_profiling import ProfileReport

* Se necessário usar os comandos abaixo para instalar estas bibliotecas
~~~ Python
# !poetry add xlrd
# !poetry add pandas-profiling[notebook]
~~~

#### 2.2 Carga dos Dados

In [18]:
df = pd.read_excel("../data/raw/default of credit card clients.xls")
df.head()

,Unnamed: 0,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
2,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
3,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
4,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0

* Percebemos:   
Que as colunas estão nomeadas como X1, X2....  
Que a Coluna "unnamed: 0" repete o o index.

#### 2.3 Arrumando Colunas e retirando coluna inutil "ID"

In [19]:
columnNames = df.iloc[0] # carrega na vareável os dados da primeira linha onde estão os nomes das colunas 
df = df[1:] # Filtra o Data Frame retirando a linha que continha o nome das colunas
df.columns = columnNames # renomea as colunas com os dados da vareável que continha os valores da prieira linha
df.pop("ID") # Exclui a coluna Inútil
df.head()

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,20000,2,2,1,24,2,2,-1,-1,-2,...,0,0,0,0,689,0,0,0,0,1
2,120000,2,2,2,26,-1,2,0,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
3,90000,2,2,2,34,0,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
4,50000,2,2,1,37,0,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
5,50000,1,2,1,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

#### 2.4 Criandeo o dicionário de Dados
O dicionário de dados contem o nome das colunas, o neme traduzido e descrição que constava no "Data Set Information" do site.

In [20]:
dicionario = df.columns.to_frame(name="Colunas").reset_index(drop=True)
dicionario["Col_Trad"] = [
    "limte",
    "sexo",
    "educacao",
    "estado_civil",
    "idade",
    "status_0509",
    "status_0508",
    "status_0507",
    "status_0506",
    "status_0505",
    "status_0504",
    "saldo_0509",
    "saldo_0508",
    "saldo_0507",
    "saldo_0506",
    "saldo_0505",
    "saldo_0504",
    "pago_0509",
    "pago_0508",
    "pago_0507",
    "pago_0506",
    "pago_0505",
    "pago_0504",
    "mau"]
dicionario["Descrição"] = [
    "Limte de Crédito",
    "(1 = masculino; 2 = feminino)",
    "Educação (1 = pós-graduação; 2 = universidade; 3 = ensino médio; 4 = outros)",
    "Estado civil (1 = casado; 2 = solteiro; 3 = outros)",
    "Idade",
    "status de pagamentos em set/2005: -1 = pago devidamente; 1 = atraso de um mês; 2 = atraso de dois meses; . . .; 8 = atraso de oito meses; 9 = atraso de nove meses ou mais",
    "status de pagamentos em ago/2005: -1 = pago devidamente; 1 = atraso de um mês; 2 = atraso de dois meses; . . .; 8 = atraso de oito meses; 9 = atraso de nove meses ou mais",
    "status de pagamentos em jul/2005: -1 = pago devidamente; 1 = atraso de um mês; 2 = atraso de dois meses; . . .; 8 = atraso de oito meses; 9 = atraso de nove meses ou mais",
    "status de pagamentos em jun/2005: -1 = pago devidamente; 1 = atraso de um mês; 2 = atraso de dois meses; . . .; 8 = atraso de oito meses; 9 = atraso de nove meses ou mais",
    "status de pagamentos em mai/2005: -1 = pago devidamente; 1 = atraso de um mês; 2 = atraso de dois meses; . . .; 8 = atraso de oito meses; 9 = atraso de nove meses ou mais",
    "status de pagamentos em abr/2005: -1 = pago devidamente; 1 = atraso de um mês; 2 = atraso de dois meses; . . .; 8 = atraso de oito meses; 9 = atraso de nove meses ou mais",
    "Saldo em set/2005",
    "Saldo em ago/2005",
    "Saldo em jul/2005",
    "Saldo em jun/2005",
    "Saldo em mai/2005",
    "Saldo em abr/2005",
    "Valor pago em set/2005",
    "Valor pago em ago/2005",
    "Valor pago em jul/2005",
    "Valor pago em jun/2005",
    "Valor pago em mai/2005",
    "Valor pago  em abr/2005",
    "Pagamento próximo mês (Sim = 1, Não = 0)"]

dicionario

,Colunas,Col_Trad,Descrição
0,LIMIT_BAL,limte,Limte de Crédito
1,SEX,sexo,(1 = masculino; 2 = feminino)
2,EDUCATION,educacao,Educação (1 = pós-graduação; 2 = universidade;...
3,MARRIAGE,estado_civil,Estado civil (1 = casado; 2 = solteiro; 3 = ou...
4,AGE,idade,Idade
5,PAY_0,status_0509,status de pagamentos em set/2005: -1 = pago de...
6,PAY_2,status_0508,status de pagamentos em ago/2005: -1 = pago de...
7,PAY_3,status_0507,status de pagamentos em jul/2005: -1 = pago de...
8,PAY_4,status_0506,status de pagamentos em jun/2005: -1 = pago de...
9,PAY_5,status_0505,status de pagamentos em mai/2005: -1 = pago de...
10,PAY_6,status_0504,status de pagamentos em abr/2005: -1 = pago de...
11,BILL_AMT1,saldo_0509,Saldo em set/2005
12,BILL_AMT2,saldo_0508,Saldo em ago/2005
13,BILL_AMT3,saldo_0507,Saldo em jul/2005
14,BILL_AMT4,saldo_0506,Saldo em jun/2005
15,BILL_AMT5,saldo_0505,Saldo em mai/2005
16,BILL_AMT6,saldo_0504,Saldo em abr/2005
17,PAY_AMT1,pago_0509,Valor pago em set/2005
18,PAY_AMT2,pago_0508,Valor pago em ago/2005
19,PAY_AMT3,pago_0507,Valor pago em jul/2005
20,PAY_AMT4,pago_0506,Valor pago em jun/2005
21,PAY_AMT5,pago_0505,Valor pago em mai/2005
22,PAY_AMT6,pago_0504,Valor pago em abr/2005
23,default payment next month,mau,"Pagamento próximo mês (Sim = 1, Não = 0)"

In [21]:
dicionario.to_csv("../references/dicionario_dados.csv", index=False)

Salvando o dicionário na pasta de referências

### 3 Analise preliminar
#### 3.1 Informações básicas

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 1 to 30000
Data columns (total 24 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   LIMIT_BAL                   30000 non-null  object
 1   SEX                         30000 non-null  object
 2   EDUCATION                   30000 non-null  object
 3   MARRIAGE                    30000 non-null  object
 4   AGE                         30000 non-null  object
 5   PAY_0                       30000 non-null  object
 6   PAY_2                       30000 non-null  object
 7   PAY_3                       30000 non-null  object
 8   PAY_4                       30000 non-null  object
 9   PAY_5                       30000 non-null  object
 10  PAY_6                       30000 non-null  object
 11  BILL_AMT1                   30000 non-null  object
 12  BILL_AMT2                   30000 non-null  object
 13  BILL_AMT3                   30000 non-null  object
 14  BILL_AMT4                   30000 non-null  object
 15  BILL_AMT5                   30000 non-null  object
 16  BILL_AMT6                   30000 non-null  object
 17  PAY_AMT1                    30000 non-null  object
 18  PAY_AMT2                    30000 non-null  object
 19  PAY_AMT3                    30000 non-null  object
 20  PAY_AMT4                    30000 non-null  object
 21  PAY_AMT5                    30000 non-null  object
 22  PAY_AMT6                    30000 non-null  object
 23  default payment next month  30000 non-null  object
dtypes: object(24)
memory usage: 5.5+ MB

Todas as linhas possuem a mesma contagem e todas são do tipo object(String)  
O Data Frame possui 30.000 linhas e 24 Colunas
#### 3.2 Busca pro dados faltantes

In [23]:
df.isnull().sum().to_frame(name = "Soma de Nulos")

                            Soma de Nulos
0
LIMIT_BAL                               0
SEX                                     0
EDUCATION                               0
MARRIAGE                                0
AGE                                     0
PAY_0                                   0
PAY_2                                   0
PAY_3                                   0
PAY_4                                   0
PAY_5                                   0
PAY_6                                   0
BILL_AMT1                               0
BILL_AMT2                               0
BILL_AMT3                               0
BILL_AMT4                               0
BILL_AMT5                               0
BILL_AMT6                               0
PAY_AMT1                                0
PAY_AMT2                                0
PAY_AMT3                                0
PAY_AMT4                                0
PAY_AMT5                                0
PAY_AMT6                                0
default payment next month              0

não existem valores nulos mas precisamos identificar se existem valores fora do dicionário

#### 3.2 Classificação das variáveis  
Inuteis:   
  ID - Ja foi exluída.  
  
Nominais:

In [24]:
sex = {1: "masculino", 2: "feminino"}
education = {1: "pós-graduação", 2: "universidade", 3: "ensino médio", 4: "outros"}
mariage = {1: "casado", 2: "solteiro", 3: "outros"}

Ordinais:

In [25]:
var_ordinais = ['LIMIT_BAL', 'AGE', 'PAY_0', 'PAY_2',
                   'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1', 'BILL_AMT2',
                   'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1',
                   'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6']

Bináreas:  

'default payment next month'

#### 3.3 Correção do tipo  

##### Variáveis numéricas

In [26]:
df[var_ordinais] = df[var_ordinais].astype(float)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 1 to 30000
Data columns (total 24 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   LIMIT_BAL                   30000 non-null  float64
 1   SEX                         30000 non-null  object
 2   EDUCATION                   30000 non-null  object
 3   MARRIAGE                    30000 non-null  object
 4   AGE                         30000 non-null  float64
 5   PAY_0                       30000 non-null  float64
 6   PAY_2                       30000 non-null  float64
 7   PAY_3                       30000 non-null  float64
 8   PAY_4                       30000 non-null  float64
 9   PAY_5                       30000 non-null  float64
 10  PAY_6                       30000 non-null  float64
 11  BILL_AMT1                   30000 non-null  float64
 12  BILL_AMT2                   30000 non-null  float64
 13  BILL_AMT3                   30000 non-null  float64
 14  BILL_AMT4                   30000 non-null  float64
 15  BILL_AMT5                   30000 non-null  float64
 16  BILL_AMT6                   30000 non-null  float64
 17  PAY_AMT1                    30000 non-null  float64
 18  PAY_AMT2                    30000 non-null  float64
 19  PAY_AMT3                    30000 non-null  float64
 20  PAY_AMT4                    30000 non-null  float64
 21  PAY_AMT5                    30000 non-null  float64
 22  PAY_AMT6                    30000 non-null  float64
 23  default payment next month  30000 non-null  object
dtypes: float64(20), object(4)
memory usage: 5.5+ MB

  
  
##### variáveis categóricas

In [27]:
df["SEX"] = df["SEX"].map(sex)
df["EDUCATION"] = df["EDUCATION"].map(education)
df["MARRIAGE"] = df["MARRIAGE"].map(mariage)
df.head()

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,20000.0,feminino,universidade,casado,24.0,2.0,2.0,-1.0,-1.0,-2.0,...,0.0,0.0,0.0,0.0,689.0,0.0,0.0,0.0,0.0,1
2,120000.0,feminino,universidade,solteiro,26.0,-1.0,2.0,0.0,0.0,0.0,...,3272.0,3455.0,3261.0,0.0,1000.0,1000.0,1000.0,0.0,2000.0,1
3,90000.0,feminino,universidade,solteiro,34.0,0.0,0.0,0.0,0.0,0.0,...,14331.0,14948.0,15549.0,1518.0,1500.0,1000.0,1000.0,1000.0,5000.0,0
4,50000.0,feminino,universidade,casado,37.0,0.0,0.0,0.0,0.0,0.0,...,28314.0,28959.0,29547.0,2000.0,2019.0,1200.0,1100.0,1069.0,1000.0,0
5,50000.0,masculino,universidade,casado,57.0,-1.0,0.0,-1.0,0.0,0.0,...,20940.0,19146.0,19131.0,2000.0,36681.0,10000.0,9000.0,689.0,679.0,0

### 4 Traduz Colunas

In [28]:
df.columns = dicionario['Col_Trad'].to_list()
df

,limte,sexo,educacao,estado_civil,idade,status_0509,status_0508,status_0507,status_0506,status_0505,...,saldo_0506,saldo_0505,saldo_0504,pago_0509,pago_0508,pago_0507,pago_0506,pago_0505,pago_0504,mau
1,20000.0,feminino,universidade,casado,24.0,2.0,2.0,-1.0,-1.0,-2.0,...,0.0,0.0,0.0,0.0,689.0,0.0,0.0,0.0,0.0,1
2,120000.0,feminino,universidade,solteiro,26.0,-1.0,2.0,0.0,0.0,0.0,...,3272.0,3455.0,3261.0,0.0,1000.0,1000.0,1000.0,0.0,2000.0,1
3,90000.0,feminino,universidade,solteiro,34.0,0.0,0.0,0.0,0.0,0.0,...,14331.0,14948.0,15549.0,1518.0,1500.0,1000.0,1000.0,1000.0,5000.0,0
4,50000.0,feminino,universidade,casado,37.0,0.0,0.0,0.0,0.0,0.0,...,28314.0,28959.0,29547.0,2000.0,2019.0,1200.0,1100.0,1069.0,1000.0,0
5,50000.0,masculino,universidade,casado,57.0,-1.0,0.0,-1.0,0.0,0.0,...,20940.0,19146.0,19131.0,2000.0,36681.0,10000.0,9000.0,689.0,679.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29996,220000.0,masculino,ensino médio,casado,39.0,0.0,0.0,0.0,0.0,0.0,...,88004.0,31237.0,15980.0,8500.0,20000.0,5003.0,3047.0,5000.0,1000.0,0
29997,150000.0,masculino,ensino médio,solteiro,43.0,-1.0,-1.0,-1.0,-1.0,0.0,...,8979.0,5190.0,0.0,1837.0,3526.0,8998.0,129.0,0.0,0.0,0
29998,30000.0,masculino,universidade,solteiro,37.0,4.0,3.0,2.0,-1.0,0.0,...,20878.0,20582.0,19357.0,0.0,0.0,22000.0,4200.0,2000.0,3100.0,1
29999,80000.0,masculino,ensino médio,casado,41.0,1.0,-1.0,0.0,0.0,0.0,...,52774.0,11855.0,48944.0,85900.0,3409.0,1178.0,1926.0,52964.0,1804.0,1
30000,50000.0,masculino,universidade,casado,46.0,0.0,0.0,0.0,0.0,0.0,...,36535.0,32428.0,15313.0,2078.0,1800.0,1430.0,1000.0,1000.0,1000.0,1

In [29]:
df.describe()

,limte,idade,status_0509,status_0508,status_0507,status_0506,status_0505,status_0504,saldo_0509,saldo_0508,saldo_0507,saldo_0506,saldo_0505,saldo_0504,pago_0509,pago_0508,pago_0507,pago_0506,pago_0505,pago_0504
count,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,3.000000e+04,30000.000000,30000.000000,30000.000000,30000.000000,3.000000e+04,30000.00000,30000.000000,30000.000000,30000.000000
mean,167484.322667,35.485500,-0.016700,-0.133767,-0.166200,-0.220667,-0.266200,-0.291100,51223.330900,49179.075167,4.701315e+04,43262.948967,40311.400967,38871.760400,5663.580500,5.921163e+03,5225.68150,4826.076867,4799.387633,5215.502567
std,129747.661567,9.217904,1.123802,1.197186,1.196868,1.169139,1.133187,1.149988,73635.860576,71173.768783,6.934939e+04,64332.856134,60797.155770,59554.107537,16563.280354,2.304087e+04,17606.96147,15666.159744,15278.305679,17777.465775
min,10000.000000,21.000000,-2.000000,-2.000000,-2.000000,-2.000000,-2.000000,-2.000000,-165580.000000,-69777.000000,-1.572640e+05,-170000.000000,-81334.000000,-339603.000000,0.000000,0.000000e+00,0.00000,0.000000,0.000000,0.000000
25%,50000.000000,28.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,3558.750000,2984.750000,2.666250e+03,2326.750000,1763.000000,1256.000000,1000.000000,8.330000e+02,390.00000,296.000000,252.500000,117.750000
50%,140000.000000,34.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,22381.500000,21200.000000,2.008850e+04,19052.000000,18104.500000,17071.000000,2100.000000,2.009000e+03,1800.00000,1500.000000,1500.000000,1500.000000
75%,240000.000000,41.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,67091.000000,64006.250000,6.016475e+04,54506.000000,50190.500000,49198.250000,5006.000000,5.000000e+03,4505.00000,4013.250000,4031.500000,4000.000000
max,1000000.000000,79.000000,8.000000,8.000000,8.000000,8.000000,8.000000,8.000000,964511.000000,983931.000000,1.664089e+06,891586.000000,927171.000000,961664.000000,873552.000000,1.684259e+06,896040.00000,621000.000000,426529.000000,528666.000000

### 4 Pandas Profiling

In [ ]:
profile = ProfileReport(df, title="Pandas Profiling Report - DATA GEAR", explorative=True)
profile

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

Salvar o report inicial

In [ ]:
profile.to_file("../references/Report_inicial.html")

In [38]:
df['educacao'].value_counts()

universidade     14030
pós-graduação    10585
ensino médio      4917
outros             123
Name: educacao, dtype: int64

In [40]:
df['educacao'].isna().sum()

345